import { TaskProps } from "@/types";

const tasks: TaskProps[] = [
  {
    id: "1",
    question: "Знаменитый вулкан в Японии",
    answer: "фудзияма",
  },
  {
    id: "2",
    question: "Столица Эквадора",
    answer: "кито",
  },
  {
    id: "3",
    question: "Самое глубокое озеро в мире",
    answer: "байкал",
  },
  {
    id: "4",
    question: "Борьба силачей на руках",
    answer: "армрестлинг",
  },

  // {
  //   id: "1",
  //   question: "Знаменитый вулкан в Японии",
  //   answer: ["ф", "у", "д", "з", "и", "я", "м", "а"],
  // },
  // {
  //   id: "2",
  //   question: "Столица Эквадора",
  //   answer: ["к", "и", "т", "о"],
  // },
  // {
  //   id: "3",
  //   question: "Самое глубокое озеро в мире",
  //   answer: ["б", "а", "й", "к", "а", "л"],
  // },
  // {
  //   id: "4",
  //   question: "Борьба силачей на руках",
  //   answer: ["а", "р", "м", "р", "е", "с", "т", "л", "и", "н", "г"],
  // },
];

export default tasks;
